{
  "date": "2015-11-26 19:00",
  "registration_url": "//www.eventbrite.com/e/front-end-london-november-2015-tickets-19473117619",
  "tickets_released": "2015-11-17 10:00",
  "duration": 2.5,
  "speakers": [
    {
      "name": "Richard Bray",
      "pic": "../../assets/images/speakers/2015/11/richard-bray.jpg",
      "company": "Stratajet",
      "twitter": "Ceiga",
      "topic": "The benefit of using single classes in CSS",
      "description": "As CSS gets more complicated with pre and post processors, making minor tweaks to a stylesheet is becoming more of a daunting task. This talk will focus on using single property or helper classes to make simple edits to the style of a page without going through the rigmarole a front end dev might have to go through.",
      "slides_url": "//speakerdeck.com/richardbray/using-single-property-classes-in-css-fel-nov-2015",
      "video_url": ""
    },
    {
      "name": "Belén Albeza",
      "pic": "../../assets/images/speakers/2015/11/belen-albeza.jpg",
      "company": "Mozilla",
      "twitter": "ladybenko",
      "topic": "Simplifying front-end",
      "description": "It is easy to fall in the trap of over-engineering, or keeping up with new JS frameworks, or using a new fancy task runner because a tweet told you so. “More” is the current default nowadays. We need to push towards “Less”. In this talk we will see how “More” is slowing us down and making us stressed, and how to declutter our front-end development so we can have less, simple and easy-to-maintain code.",
      "slides_url": "//belen-albeza.github.io/simplify-front-end-fel/",
      "video_url": ""
    },
    {
      "name": "Oliver Joseph Ash",
      "pic": "../../assets/images/speakers/2015/11/oliver-j-ash.jpg",
      "company": "The Guardian",
      "twitter": "oliverjash",
      "topic": "Building an Offline Page for theguardian.com",
      "description": "You’re on a train to work and you open up the Guardian app on your phone. A tunnel surrounds you, but the app still works in very much the same way as it usually would—despite your lack of internet connection, you still get the full experience, only the content shown will be stale. If you tried the same for the Guardian website, however, it wouldn’t load at all. Native apps have long had the tools to deal with these situations, in order to deliver rich user experiences whatever the user’s situation may be. With service workers, the web is catching up.",
      "slides_url": "//speakerdeck.com/oliverjash/building-an-offline-page-for-theguardian-dot-com",
      "video_url": ""
    }
  ]
}
