{
  "date": "2016-11-24 19:00",
  "registration_url": "//www.eventbrite.com/e/front-end-london-november-2016-tickets-29376433704",
  "tickets_released": "2016-11-15 10:00",
  "duration": 2.5,
  "speakers": [
    {
      "name": "Monika Koziol",
      "pic": "../../assets/images/speakers/2016/11/koziol-monika.jpg",
      "company": "Red Badger",
      "twitter": "MonikaKoziol",
      "topic": "Designing in cross functional teams",
      "description": "Teamwork... love it or hate it, no modern web application has been built by a single person. This talk will cover the benefits of designing component based UIs, lean methods, kanban and working in cross functional and co-located teams. All from a designer’s perspective.",
      "slides_url": "",
      "video_url": ""
    },
    {
      "name": "Peter Gasston",
      "pic": "../../assets/images/speakers/2016/11/gasston-peter.jpg",
      "company": "rehabstudio",
      "twitter": "stopsatgreen",
      "topic": "Surveying the landscape",
      "description": "As it approaches a degree of maturity as a telecomms channel, the web is going through some changes. Using extensive reference and research, this talk takes a big-picture view of some of the trends in publishing and information consumption on the web, looking at the demands of the millions of new users in emerging markets, and the way that technology is adapting to accommodate them.\nThis talk will raise and try to answer questions such as: what is the role of the web in the new landscape? And what are the threats to, and opportunities for, the open web and web development?",
      "slides_url": "//speakerdeck.com/stopsatgreen/surveying-the-landscape-november-2016",
      "video_url": "",
      "longhand_url": "//petergasston.co.uk/surveying-the-landscape/"
    },
    {
      "name": "Phil Nash",
      "pic": "../../assets/images/speakers/2013/03/phil.jpg",
      "company": "Twilio",
      "twitter": "philnash",
      "topic": "An empty database in every pocket",
      "description": "IndexedDB is not new. It is supported in almost every browser. Without it, the future of progressive web apps are in peril. But there is not a lot of love for it and that needs to change.\nWe'll investigate why we should love IndexedDB and the kind of apps you can create when you have the power of a database in the browser. Then we'll dive into how to use IndexedDB with a look at both the terrifying API and the friendly libraries that will help us along the way. Together we'll discover a new love for IndexedDB.",
      "slides_url": "",
      "video_url": ""
    }
  ]
}
