{
  "date": "2017-03-30 19:00",
  "registration_url": "//www.eventbrite.com/e/front-end-london-march-2017-tickets-32528151577",
  "tickets_released": "2017-03-21 10:00",
  "duration": 2.5,
  "speakers": [
    {
      "name": "Melinda Seckington",
      "pic": "../../assets/images/speakers/2017/03/seckington-melinda.jpg",
      "company": "FutureLearn",
      "twitter": "mseckington",
      "topic": "Reflect and refactor",
      "description": "As developers, we’re constantly learning: whether it’s figuring out how to solve new problems and bugs, or focusing on new skills and knowledge to apply to our work. Often when we talk about reflecting and refactoring, it will be about the way we work in our teams or how we can make our code better — but why don’t we apply the same method to ourselves?",
      "slides_url": "",
      "video_url": ""
    },
    {
      "name": "Oliver Williams",
      "pic": "../../assets/images/speakers/2017/03/williams-oliver.jpg",
      "company": "Chamberlain Music",
      "twitter": "css_grid",
      "topic": "Sizing with content",
      "description": "From pixels to percentages, we’re already spoilt for choice when it comes to CSS sizing units. Intrinsic sizing offers us a new way of doing things - sizing from the content out. Learn about three little-known CSS keywords — min-content, max-content and fit-content and how they offer us a unique way to size our elements.",
      "slides_url": "",
      "video_url": ""
    },
    {
      "name": "Shaun Dunne",
      "pic": "../../assets/images/speakers/2017/03/dunne-shaun.jpg",
      "company": "Studio Zero",
      "twitter": "shaundunne",
      "topic": "The Open Metaverse",
      "description": "The Metaverse is far too big of an idea for an app store. On the web VR can be sharable via a URL, it can be discovered via a search engine, you can tweet it or embed it on your Wordpress blog and allow it to spread to millions of people. WebVR is both the biggest change for VR and the Web so let Shaun introduce you to what the current status is of the Standards, tools and the sort of things you can build.",
      "slides_url": "",
      "video_url": ""
    }
  ]
}
