{
  "date": "2018-02-22 19:00",
  "registration_url": "//www.eventbrite.com/e/front-end-london-february-2018-tickets-43163707812",
  "tickets_released": "2018-02-15 10:00",
  "duration": 2.5,
  "speakers": [
    {
      "name": "Phil Hawksworth",
      "pic": "../../assets/images/speakers/2018/02/phil-hawksworth.jpg",
      "company": "Netlify",
      "twitter": "philhawksworth",
      "topic": "Stealthy git - solving CMS woes with git, on the quiet",
      "description": "Content management systems are rarely fun to use. Not for developers, not for authors. They hamper effective development and they invent confusing processes for content authors.\nWhat if we could build a CMS on top of git? What if instead of trying to invent new ways to solve things like version control, publishing approval, previews, and accountability, we used git which already has mechanisms to cope with these things and more?\nAlthough developers might welcome this, content authors might not. Especially if we asked them to learn git so that they could do their work. Let’s not tell them. Let’s do it all behind the scenes and give them the benefits without exposing them to the underlying technology.\nThis talk will look at how Netlify CMS (an increasingly popular open source project) is marrying powerful git workflows with static site generators, continuous integration tools, and a flexible admin interface to make building and maintaining a CMS powered site a joy for all.",
      "slides_url": "",
      "video_url": "//www.youtube.com/watch?v=ZvnaZZRaE3Q&t=0s&list=PLOSHQ_hfikSqtPf8kWSO1fQZ0VO86cpN9&index=11",
      "poster": "../../assets/images/posters/ZvnaZZRaE3Q.jpg"
    },
    {
      "name": "Thomas Parisot",
      "pic": "../../assets/images/speakers/2018/02/thomas-parisot.jpg",
      "company": "DTC Innovation",
      "twitter": "oncletom",
      "topic": "Writing a book in 2018",
      "description": "The usual way of writing a technical book is to open the Word or LibreOffice application, to write some content, to make a backup, to send it by email to the publisher and to deal with the feedbacks. And repeat.\nHowever in 2018 we can do differently by using open formats like Asciidoc, by using version control to propagate changes, by using collaborative platforms like GitHub or GitLab to collate feedbacks in any form as well as transforming text and code into readable and interactive artefacts.\nIt gives us a unique opportunity to approach the whole process of writing in term of “content experience”, of “toolchain” and of “distribution”.\n\nIn the end, a “book” becomes a “writing format” as we can reuse the same pattern to manage any kind of “content” — articles, publications, essays, documentation — that we can transform in physical books, e-books, interactive web pages etc.",
      "slides_url": "",
      "video_url": "//www.youtube.com/watch?v=ac_QcHv-tyo&t=0s&list=PLOSHQ_hfikSqtPf8kWSO1fQZ0VO86cpN9&index=9",
      "poster": "../../assets/images/posters/ac_QcHv-tyo.jpg"
    }
  ]
}
