{
  "date": "2019-11-28 19:00",
  "registration_url": "//www.eventbrite.com/e/front-end-london-nov-2019-tickets-81302406687",
  "tickets_released": "2019-11-19 10:00",
  "duration": 2.5,
  "speakers": [
    {
      "name": "Jag Reehal",
      "pic": "../../assets/images/speakers/2019/11/reehal-jag.jpeg",
      "company": "",
      "twitter": "jagreehal",
      "topic": "Build Components and not Walls",
      "description": "With a new JavaScript framework out at the end of every other week, it's difficult to know what's the right choice. Then when you finally decide, it can be a rollercoaster journey. \n At the moment React is the king, before that it was Angular, before that Backbone. In this talk, I'll share my experience of building, sharing and reusing components that can be used with legacy, current and frameworks of the future.",
      "slides_url": "",
      "video_url": ""
    },
    {
      "name": "Richard Ng",
      "pic": "../../assets/images/speakers/2019/11/ng-richard.jpg",
      "company": "WhiteHat",
      "twitter": "richardcrng",
      "topic": "Redux-Leaves: write once, reduce anywhere!",
      "description": "With the new React-Redux hooks, Redux is now even more useful, powerful and great. But it can still be hard for new developers to learn, tedious for experienced developers to set up, and painful for code boilerplate and file structuring. What if we could make it easier for developers to get the use, power and great developer experience from Redux? \n In this talk, I’ll introduce Redux-Leaves, a library that I wrote to make Redux simpler to learn and easier to scale. I’ll try to demonstrate the practical benefits of the library and how it particularly complements middleware like Redux-Thunk or Redux-Saga. I’ll also talk about my ongoing experience in writing the library, such as lessons learned in refactoring it into Typescript and 'Documentation-Driven Development'.",
      "slides_url": "",
      "video_url": ""
    },
    {
      "name": "Jonathan Wagner",
      "pic": "../../assets/images/speakers/2019/11/wagner-jonathan.jpg",
      "company": "Theodo",
      "twitter": "john_waitforit",
      "topic": "Apps are dead - long live PWAs",
      "description": "Did you ever wish you could create a mobile app in JS working across desktop and mobile? PWAs are a great way to do this quickly with less deployment complexity, faster deployment and reduced developer resources. \n PWAs are not limited by app stores rules and you can ship multiple times a day. Uber, Lyft, Tinder, Pinterest and Twitter did it and improved their mobile user stickiness massively. This talk will present what PWAs can do, their limitations and the problems I encountered developing one.",
      "slides_url": "",
      "video_url": ""
    }
  ]
}
